; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image3 - mode
	infrared2 - mode
	infrared1 - mode
	thermograph0 - mode
	Star16 - direction
	Star17 - direction
	Star26 - direction
	Star23 - direction
	GroundStation6 - direction
	GroundStation15 - direction
	Star0 - direction
	GroundStation21 - direction
	Star3 - direction
	Star9 - direction
	Star4 - direction
	Star19 - direction
	GroundStation29 - direction
	GroundStation5 - direction
	GroundStation27 - direction
	Star7 - direction
	Star12 - direction
	GroundStation20 - direction
	Star14 - direction
	Star13 - direction
	GroundStation8 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation28 - direction
	GroundStation25 - direction
	GroundStation10 - direction
	GroundStation18 - direction
	GroundStation22 - direction
	Star11 - direction
	Star24 - direction
	Phenomenon30 - direction
	Star31 - direction
	Star32 - direction
	Phenomenon33 - direction
	Planet34 - direction
	Phenomenon35 - direction
	Planet36 - direction
	Star37 - direction
	Planet38 - direction
	Star39 - direction
	Planet40 - direction
	Planet41 - direction
	Phenomenon42 - direction
	Star43 - direction
	Phenomenon44 - direction
	Planet45 - direction
	Planet46 - direction
	Planet47 - direction
	Star48 - direction
	Phenomenon49 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation22)
	(calibration_target instrument0 GroundStation27)
	(calibration_target instrument0 GroundStation21)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation29)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star23)
	(calibration_target instrument1 GroundStation18)
	(calibration_target instrument1 Star4)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation10)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation22)
	(calibration_target instrument4 GroundStation15)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation29)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star19)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation21)
	(supports instrument6 infrared2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation27)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument7 image3)
	(supports instrument7 infrared2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 Star13)
	(calibration_target instrument7 Star14)
	(calibration_target instrument7 GroundStation20)
	(calibration_target instrument7 Star12)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 Star24)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star24)
	(calibration_target instrument8 Star11)
	(calibration_target instrument8 GroundStation22)
	(calibration_target instrument8 GroundStation18)
	(calibration_target instrument8 GroundStation10)
	(calibration_target instrument8 GroundStation25)
	(calibration_target instrument8 GroundStation28)
	(calibration_target instrument8 GroundStation1)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star23)
)
(:goal (and
	(have_image Phenomenon30 image3)
	(have_image Star31 infrared2)
	(have_image Star32 thermograph0)
	(have_image Phenomenon33 image3)
	(have_image Planet34 infrared2)
	(have_image Phenomenon35 thermograph0)
	(have_image Planet36 thermograph0)
	(have_image Star37 image3)
	(have_image Planet38 thermograph0)
	(have_image Star39 infrared2)
	(have_image Planet40 infrared1)
	(have_image Planet41 infrared1)
	(have_image Phenomenon42 image3)
	(have_image Star43 image3)
	(have_image Phenomenon44 image3)
	(have_image Planet45 thermograph0)
	(have_image Planet46 infrared2)
	(have_image Planet47 thermograph0)
	(have_image Star48 thermograph0)
	(have_image Phenomenon49 infrared2)
))

)

; plan
1. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 20
2. (switch_on instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 0 of 20
3. (turn_to satellite2 phenomenon30 star23)
   deleted: (pointing satellite2 star23)
   added: (pointing satellite2 phenomenon30)
   goals met: 0 of 20
4. (turn_to satellite1 groundstation5 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 20
5. (calibrate satellite1 instrument6 groundstation5)
   added: (calibrated instrument6)
   goals met: 0 of 20
6. (turn_to satellite1 phenomenon49 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon49)
   goals met: 0 of 20
7. (take_image satellite1 phenomenon49 instrument6 infrared2)
   added: (have_image phenomenon49 infrared2)
   goals met: 1 of 20
8. (turn_to satellite1 planet34 phenomenon49)
   deleted: (pointing satellite1 phenomenon49)
   added: (pointing satellite1 planet34)
   goals met: 1 of 20
9. (take_image satellite1 planet34 instrument6 infrared2)
   added: (have_image planet34 infrared2)
   goals met: 2 of 20
10. (turn_to satellite1 planet40 planet34)
   deleted: (pointing satellite1 planet34)
   added: (pointing satellite1 planet40)
   goals met: 2 of 20
11. (take_image satellite1 planet40 instrument6 infrared1)
   added: (have_image planet40 infrared1)
   goals met: 3 of 20
12. (turn_to satellite1 planet41 planet40)
   deleted: (pointing satellite1 planet40)
   added: (pointing satellite1 planet41)
   goals met: 3 of 20
13. (take_image satellite1 planet41 instrument6 infrared1)
   added: (have_image planet41 infrared1)
   goals met: 4 of 20
14. (turn_to satellite1 planet46 planet41)
   deleted: (pointing satellite1 planet41)
   added: (pointing satellite1 planet46)
   goals met: 4 of 20
15. (take_image satellite1 planet46 instrument6 infrared2)
   added: (have_image planet46 infrared2)
   goals met: 5 of 20
16. (turn_to satellite1 star31 planet46)
   deleted: (pointing satellite1 planet46)
   added: (pointing satellite1 star31)
   goals met: 5 of 20
17. (take_image satellite1 star31 instrument6 infrared2)
   added: (have_image star31 infrared2)
   goals met: 6 of 20
18. (turn_to satellite1 star39 star31)
   deleted: (pointing satellite1 star31)
   added: (pointing satellite1 star39)
   goals met: 6 of 20
19. (take_image satellite1 star39 instrument6 infrared2)
   added: (have_image star39 infrared2)
   goals met: 7 of 20
20. (turn_to satellite2 star7 phenomenon30)
   deleted: (pointing satellite2 phenomenon30)
   added: (pointing satellite2 star7)
   goals met: 7 of 20
21. (calibrate satellite2 instrument7 star7)
   added: (calibrated instrument7)
   goals met: 7 of 20
22. (turn_to satellite2 phenomenon30 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon30)
   goals met: 7 of 20
23. (take_image satellite2 phenomenon30 instrument7 image3)
   added: (have_image phenomenon30 image3)
   goals met: 8 of 20
24. (turn_to satellite2 phenomenon33 phenomenon30)
   deleted: (pointing satellite2 phenomenon30)
   added: (pointing satellite2 phenomenon33)
   goals met: 8 of 20
25. (take_image satellite2 phenomenon33 instrument7 image3)
   added: (have_image phenomenon33 image3)
   goals met: 9 of 20
26. (turn_to satellite2 phenomenon35 phenomenon33)
   deleted: (pointing satellite2 phenomenon33)
   added: (pointing satellite2 phenomenon35)
   goals met: 9 of 20
27. (take_image satellite2 phenomenon35 instrument7 thermograph0)
   added: (have_image phenomenon35 thermograph0)
   goals met: 10 of 20
28. (turn_to satellite2 phenomenon42 phenomenon35)
   deleted: (pointing satellite2 phenomenon35)
   added: (pointing satellite2 phenomenon42)
   goals met: 10 of 20
29. (take_image satellite2 phenomenon42 instrument7 image3)
   added: (have_image phenomenon42 image3)
   goals met: 11 of 20
30. (turn_to satellite2 phenomenon44 phenomenon42)
   deleted: (pointing satellite2 phenomenon42)
   added: (pointing satellite2 phenomenon44)
   goals met: 11 of 20
31. (take_image satellite2 phenomenon44 instrument7 image3)
   added: (have_image phenomenon44 image3)
   goals met: 12 of 20
32. (turn_to satellite2 planet36 phenomenon44)
   deleted: (pointing satellite2 phenomenon44)
   added: (pointing satellite2 planet36)
   goals met: 12 of 20
33. (take_image satellite2 planet36 instrument7 thermograph0)
   added: (have_image planet36 thermograph0)
   goals met: 13 of 20
34. (turn_to satellite2 planet38 planet36)
   deleted: (pointing satellite2 planet36)
   added: (pointing satellite2 planet38)
   goals met: 13 of 20
35. (take_image satellite2 planet38 instrument7 thermograph0)
   added: (have_image planet38 thermograph0)
   goals met: 14 of 20
36. (turn_to satellite2 planet45 planet38)
   deleted: (pointing satellite2 planet38)
   added: (pointing satellite2 planet45)
   goals met: 14 of 20
37. (take_image satellite2 planet45 instrument7 thermograph0)
   added: (have_image planet45 thermograph0)
   goals met: 15 of 20
38. (turn_to satellite2 planet47 planet45)
   deleted: (pointing satellite2 planet45)
   added: (pointing satellite2 planet47)
   goals met: 15 of 20
39. (take_image satellite2 planet47 instrument7 thermograph0)
   added: (have_image planet47 thermograph0)
   goals met: 16 of 20
40. (turn_to satellite2 star32 planet47)
   deleted: (pointing satellite2 planet47)
   added: (pointing satellite2 star32)
   goals met: 16 of 20
41. (take_image satellite2 star32 instrument7 thermograph0)
   added: (have_image star32 thermograph0)
   goals met: 17 of 20
42. (turn_to satellite2 star37 star32)
   deleted: (pointing satellite2 star32)
   added: (pointing satellite2 star37)
   goals met: 17 of 20
43. (take_image satellite2 star37 instrument7 image3)
   added: (have_image star37 image3)
   goals met: 18 of 20
44. (turn_to satellite2 star43 star37)
   deleted: (pointing satellite2 star37)
   added: (pointing satellite2 star43)
   goals met: 18 of 20
45. (take_image satellite2 star43 instrument7 image3)
   added: (have_image star43 image3)
   goals met: 19 of 20
46. (turn_to satellite2 star48 star43)
   deleted: (pointing satellite2 star43)
   added: (pointing satellite2 star48)
   goals met: 19 of 20
47. (take_image satellite2 star48 instrument7 thermograph0)
   added: (have_image star48 thermograph0)
   goals met: 20 of 20
